StephenGit597/STM32F103C8_Header_Files/STM32F103C8_NVIC.h
/*-----------------------------------*/
/*          Designer:Stephen         */
/*           SWU_AI_2024_1           */
/*-----------------------------------*/
#ifndef STM32F103C8_NVIC_h
#define STM32F103C8_NVIC_h
//必要头文件引用
#include <stdint.h>//C99位宽头文件

/*NVIC*/
//NVIC基地址常量定义
#define NVIC_BASE 0xE000E100
//NVIC基地址定义
#define NVIC ((Typedef_NVIC*)NVIC_BASE)
//NVIC结构体定义
typedef struct 
{
	volatile uint32_t ISER[2];    //Interrupt Set-Enable Register
	uint32_t None0[30];
	volatile uint32_t ICER[2];    //Interrupt Clear-Enable Register
	uint32_t None1[30];
	volatile uint32_t ISPR[2];    //Interrupt Set-Pending Register
	uint32_t None2[30];
	volatile uint32_t ICPR[2];    //Interrupt Clear-Pending Register
	uint32_t None3[30];
	volatile uint32_t IABR[2];    //Interrupt Active Bit Register
	uint32_t None4[62];
	volatile uint32_t IPR[15];    //Interrupt Priority Register
}Typedef_NVIC;
//系统中断分组寄存器
#define AIRCR (*(volatile uint32_t *)0xE000ED0C)//Application Interrupt and Reset Control Register
/*中断向量表
0_WWDG
1_PVD
2_TAMPER
3_RTC
4_FLASH
5_RCC
6_EXTI0
7_EXTI1
8_EXTI2
9_EXTI3
10_EXTI4
11_DMA1_CH1
12_DMA1_CH2
13_DMA1_CH3
14_DMA1_CH4
15_DMA1_CH5
16_DMA1_CH6
17_DMA1_CH7
18_ADC1_2
19_CAN1_TX
20_CAN1_RX0 
21_CAN1_RX1
22_CAN_SCE
23_EXTI9_5 
24_TIM1_BRK
25_TIM1_UP
26_TIM1_TRG_COM
27_TIM1_CC
28_TIM2
29_TIM3
30_TIM4
31_I2C1_EV
32_I2C1_ER
33_I2C2_EV
34_I2C2_ER
35_SPI1
36_SPI2
37_USART1
38_USART2
39_USART3
40_EXTI15_10
41_RTCAlarm
42_OTG_FS_WKUP
*/

//Interrupt Set-Enable Register
//Interrupt Set-Enable Register 0
#define NVIC_Interrupt_Set_Enable_Register0_0_WWDG_Set_Enable 0x00000001
#define NVIC_Interrupt_Set_Enable_Register0_1_PVD_Set_Enable 0x00000002
#define NVIC_Interrupt_Set_Enable_Register0_2_TAMPER_Set_Enable 0x00000004
#define NVIC_Interrupt_Set_Enable_Register0_3_RTC_Set_Enable 0x00000008
#define NVIC_Interrupt_Set_Enable_Register0_4_FLASH_Set_Enable 0x00000010
#define NVIC_Interrupt_Set_Enable_Register0_5_RCC_Set_Enable 0x00000020
#define NVIC_Interrupt_Set_Enable_Register0_6_EXTI0_Set_Enable 0x00000040
#define NVIC_Interrupt_Set_Enable_Register0_7_EXTI1_Set_Enable 0x00000080
#define NVIC_Interrupt_Set_Enable_Register0_8_EXTI2_Set_Enable 0x00000100
#define NVIC_Interrupt_Set_Enable_Register0_9_EXTI3_Set_Enable 0x00000200
#define NVIC_Interrupt_Set_Enable_Register0_10_EXTI4_Set_Enable 0x00000400
#define NVIC_Interrupt_Set_Enable_Register0_11_DMA1_CH1_Set_Enable 0x00000800
#define NVIC_Interrupt_Set_Enable_Register0_12_DMA1_CH2_Set_Enable 0x00001000
#define NVIC_Interrupt_Set_Enable_Register0_13_DMA1_CH3_Set_Enable 0x00002000
#define NVIC_Interrupt_Set_Enable_Register0_14_DMA1_CH4_Set_Enable 0x00004000
#define NVIC_Interrupt_Set_Enable_Register0_15_DMA1_CH5_Set_Enable 0x00008000
#define NVIC_Interrupt_Set_Enable_Register0_16_DMA1_CH6_Set_Enable 0x00010000
#define NVIC_Interrupt_Set_Enable_Register0_17_DMA1_CH7_Set_Enable 0x00020000
#define NVIC_Interrupt_Set_Enable_Register0_18_ADC1_2_Set_Enable 0x00040000
#define NVIC_Interrupt_Set_Enable_Register0_19_CAN1_TX_Set_Enable 0x00080000
#define NVIC_Interrupt_Set_Enable_Register0_20_CAN1_RX0_Set_Enable 0x00100000
#define NVIC_Interrupt_Set_Enable_Register0_21_CAN1_RX1_Set_Enable 0x00200000
#define NVIC_Interrupt_Set_Enable_Register0_22_CAN_SCE_Set_Enable 0x00400000
#define NVIC_Interrupt_Set_Enable_Register0_23_EXTI9_5_Set_Enable 0x00800000
#define NVIC_Interrupt_Set_Enable_Register0_24_TIM1_BRK_Set_Enable 0x01000000
#define NVIC_Interrupt_Set_Enable_Register0_25_TIM1_UP_Set_Enable 0x02000000
#define NVIC_Interrupt_Set_Enable_Register0_26_TIM1_TRG_COM_Set_Enable 0x04000000
#define NVIC_Interrupt_Set_Enable_Register0_27_TIM1_CC_Set_Enable 0x08000000
#define NVIC_Interrupt_Set_Enable_Register0_28_TIM2_Set_Enable 0x10000000
#define NVIC_Interrupt_Set_Enable_Register0_29_TIM3_Set_Enable 0x20000000
#define NVIC_Interrupt_Set_Enable_Register0_30_TIM4_Set_Enable 0x40000000
#define NVIC_Interrupt_Set_Enable_Register0_31_I2C1_EV_Set_Enable 0x80000000
//Interrupt Set-Enable Register 1
#define NVIC_Interrupt_Set_Enable_Register1_32_I2C1_ER_Set_Enable 0x00000001
#define NVIC_Interrupt_Set_Enable_Register1_33_I2C2_EV_Set_Enable 0x00000002
#define NVIC_Interrupt_Set_Enable_Register1_34_I2C2_ER_Set_Enable 0x00000004
#define NVIC_Interrupt_Set_Enable_Register1_35_SPI1_Set_Enable 0x00000008
#define NVIC_Interrupt_Set_Enable_Register1_36_SPI2_Set_Enable 0x00000010
#define NVIC_Interrupt_Set_Enable_Register1_37_USART1_Set_Enable 0x00000020
#define NVIC_Interrupt_Set_Enable_Register1_38_USART2_Set_Enable 0x00000040
#define NVIC_Interrupt_Set_Enable_Register1_39_USART3_Set_Enable 0x00000080
#define NVIC_Interrupt_Set_Enable_Register1_40_EXTI15_10_Set_Enable 0x00000100
#define NVIC_Interrupt_Set_Enable_Register1_41_RTCAlarm_Set_Enable 0x00000200
#define NVIC_Interrupt_Set_Enable_Register1_42_OTG_FS_WKUP_Set_Enable 0x00000400

//Interrupt Clear-Enable Register
//Interrupt Clear-Enable Register0
#define NVIC_Interrupt_Clear_Enable_Register0_0_WWDG_Clear_Enable 0x00000001
#define NVIC_Interrupt_Clear_Enable_Register0_1_PVD_Clear_Enable 0x00000002
#define NVIC_Interrupt_Clear_Enable_Register0_2_TAMPER_Clear_Enable 0x00000004
#define NVIC_Interrupt_Clear_Enable_Register0_3_RTC_Clear_Enable 0x00000008
#define NVIC_Interrupt_Clear_Enable_Register0_4_FLASH_Clear_Enable 0x00000010
#define NVIC_Interrupt_Clear_Enable_Register0_5_RCC_Clear_Enable 0x00000020
#define NVIC_Interrupt_Clear_Enable_Register0_EXTI0_Clear_Enable 0x00000040
#define NVIC_Interrupt_Clear_Enable_Register0_7_EXTI1_Clear_Enable 0x00000080
#define NVIC_Interrupt_Clear_Enable_Register0_8_EXTI2_Clear_Enable 0x00000100
#define NVIC_Interrupt_Clear_Enable_Register0_9_EXTI3_Clear_Enable 0x00000200
#define NVIC_Interrupt_Clear_Enable_Register0_10_EXTI4_Clear_Enable 0x00000400
#define NVIC_Interrupt_Clear_Enable_Register0_11_DMA1_CH1_Clear_Enable 0x00000800
#define NVIC_Interrupt_Clear_Enable_Register0_12_DMA1_CH2_Clear_Enable 0x00001000
#define NVIC_Interrupt_Clear_Enable_Register0_13_DMA1_CH3_Clear_Enable 0x00002000
#define NVIC_Interrupt_Clear_Enable_Register0_14_DMA1_CH4_Clear_Enable 0x00004000
#define NVIC_Interrupt_Clear_Enable_Register0_15_DMA1_CH5_Clear_Enable 0x00008000
#define NVIC_Interrupt_Clear_Enable_Register0_16_DMA1_CH6_Clear_Enable 0x00010000
#define NVIC_Interrupt_Clear_Enable_Register0_17_DMA1_CH7_Clear_Enable 0x00020000
#define NVIC_Interrupt_Clear_Enable_Register0_18_ADC1_2_Clear_Enable 0x00040000
#define NVIC_Interrupt_Clear_Enable_Register0_19_CAN1_TX_Clear_Enable 0x00080000
#define NVIC_Interrupt_Clear_Enable_Register0_20_CAN1_RX0_Clear_Enable 0x00100000
#define NVIC_Interrupt_Clear_Enable_Register0_21_CAN1_RX1_Clear_Enable 0x00200000
#define NVIC_Interrupt_Clear_Enable_Register0_22_CAN_SCE_Clear_Enable 0x00400000
#define NVIC_Interrupt_Clear_Enable_Register0_23_EXTI9_5_Clear_Enable 0x00800000
#define NVIC_Interrupt_Clear_Enable_Register0_24_TIM1_BRK_Clear_Enable 0x01000000
#define NVIC_Interrupt_Clear_Enable_Register0_25_TIM1_UP_Clear_Enable 0x02000000
#define NVIC_Interrupt_Clear_Enable_Register0_26_TIM1_TRG_COM_Clear_Enable 0x04000000
#define NVIC_Interrupt_Clear_Enable_Register0_27_TIM1_CC_Clear_Enable 0x08000000
#define NVIC_Interrupt_Clear_Enable_Register0_28_TIM2_Clear_Enable 0x10000000
#define NVIC_Interrupt_Clear_Enable_Register0_29_TIM3_Clear_Enable 0x20000000
#define NVIC_Interrupt_Clear_Enable_Register0_30_TIM4_Clear_Enable 0x40000000
#define NVIC_Interrupt_Clear_Enable_Register0_31_I2C1_EV_Clear_Enable 0x80000000
//Interrupt Clear-Enable Register1
#define NVIC_Interrupt_Clear_Enable_Register1_32_I2C1_ER_Set_Enable 0x00000001
#define NVIC_Interrupt_Clear_Enable_Register1_33_I2C2_EV_Set_Enable 0x00000002
#define NVIC_Interrupt_Clear_Enable_Register1_34_I2C2_ER_Set_Enable 0x00000004
#define NVIC_Interrupt_Clear_Enable_Register1_35_SPI1_Set_Enable 0x00000008
#define NVIC_Interrupt_Clear_Enable_Register1_36_SPI2_Set_Enable 0x00000010
#define NVIC_Interrupt_Clear_Enable_Register1_37_USART1_Set_Enable 0x00000020
#define NVIC_Interrupt_Clear_Enable_Register1_38_USART2_Set_Enable 0x00000040
#define NVIC_Interrupt_Clear_Enable_Register1_39_USART3_Set_Enable 0x00000080
#define NVIC_Interrupt_Clear_Enable_Register1_40_EXTI15_10_Set_Enable 0x00000100
#define NVIC_Interrupt_Clear_Enable_Register1_41_RTCAlarm_Set_Enable 0x00000200
#define NVIC_Interrupt_Clear_Enable_Register1_42_OTG_FS_WKUP_Set_Enable 0x00000400

//Interrupt Set-Pending Register
//Interrupt Set-Pending Register0
#define NVIC_Interrupt_Set_Pending_Register0_0_WWDG_Set_Pending 0x00000001
#define NVIC_Interrupt_Set_Pending_Register0_1_PVD_Set_Pending 0x00000002
#define NVIC_Interrupt_Set_Pending_Register0_2_TAMPER_Set_Pending 0x00000004
#define NVIC_Interrupt_Set_Pending_Register0_3_RTC_Set_Pending 0x00000008
#define NVIC_Interrupt_Set_Pending_Register0_4_FLASH_Set_Pending 0x00000010
#define NVIC_Interrupt_Set_Pending_Register0_5_RCC_Set_Pending 0x00000020
#define NVIC_Interrupt_Set_Pending_Register0_EXTI0_Set_Pending 0x00000040
#define NVIC_Interrupt_Set_Pending_Register0_7_EXTI1_Set_Pending 0x00000080
#define NVIC_Interrupt_Set_Pending_Register0_8_EXTI2_Set_Pending 0x00000100
#define NVIC_Interrupt_Set_Pending_Register0_9_EXTI3_Set_Pending 0x00000200
#define NVIC_Interrupt_Set_Pending_Register0_10_EXTI4_Set_Pending 0x00000400
#define NVIC_Interrupt_Set_Pending_Register0_11_DMA1_CH1_Set_Pending 0x00000800
#define NVIC_Interrupt_Set_Pending_Register0_12_DMA1_CH2_Set_Pending 0x00001000
#define NVIC_Interrupt_Set_Pending_Register0_13_DMA1_CH3_Set_Pending 0x00002000
#define NVIC_Interrupt_Set_Pending_Register0_14_DMA1_CH4_Set_Pending 0x00004000
#define NVIC_Interrupt_Set_Pending_Register0_15_DMA1_CH5_Set_Pending 0x00008000
#define NVIC_Interrupt_Set_Pending_Register0_16_DMA1_CH6_Set_Pending 0x00010000
#define NVIC_Interrupt_Set_Pending_Register0_17_DMA1_CH7_Set_Pending 0x00020000
#define NVIC_Interrupt_Set_Pending_Register0_18_ADC1_2_Set_Pending 0x00040000
#define NVIC_Interrupt_Set_Pending_Register0_19_CAN1_TX_Set_Pending 0x00080000
#define NVIC_Interrupt_Set_Pending_Register0_20_CAN1_RX0_Set_Pending 0x00100000
#define NVIC_Interrupt_Set_Pending_Register0_21_CAN1_RX1_Set_Pending 0x00200000
#define NVIC_Interrupt_Set_Pending_Register0_22_CAN_SCE_Set_Pending 0x00400000
#define NVIC_Interrupt_Set_Pending_Register0_23_EXTI9_5_Set_Pending 0x00800000
#define NVIC_Interrupt_Set_Pending_Register0_24_TIM1_BRK_Set_Pending 0x01000000
#define NVIC_Interrupt_Set_Pending_Register0_25_TIM1_UP_Set_Pending 0x02000000
#define NVIC_Interrupt_Set_Pending_Register0_26_TIM1_TRG_COM_Set_Pending 0x04000000
#define NVIC_Interrupt_Set_Pending_Register0_27_TIM1_CC_Set_Pending 0x08000000
#define NVIC_Interrupt_Set_Pending_Register0_28_TIM2_Set_Pending 0x10000000
#define NVIC_Interrupt_Set_Pending_Register0_29_TIM3_Set_Pending 0x20000000
#define NVIC_Interrupt_Set_Pending_Register0_30_TIM4_Set_Pending 0x40000000
#define NVIC_Interrupt_Set_Pending_Register0_31_I2C1_EV_Set_Pending 0x80000000
//Interrupt Set-Pending Register1
#define NVIC_Interrupt_Set_Pending_Register1_32_I2C1_ER_Set_Pending 0x00000001
#define NVIC_Interrupt_Set_Pending_Register1_33_I2C2_EV_Set_Pending 0x00000002
#define NVIC_Interrupt_Set_Pending_Register1_34_I2C2_ER_Set_Pending 0x00000004
#define NVIC_Interrupt_Set_Pending_Register1_35_SPI1_Set_Pending 0x00000008
#define NVIC_Interrupt_Set_Pending_Register1_36_SPI2_Set_Pending 0x00000010
#define NVIC_Interrupt_Set_Pending_Register1_37_USART1_Set_Pending 0x00000020
#define NVIC_Interrupt_Set_Pending_Register1_38_USART2_Set_Pending 0x00000040
#define NVIC_Interrupt_Set_Pending_Register1_39_USART3_Set_Pending 0x00000080
#define NVIC_Interrupt_Set_Pending_Register1_40_EXTI15_10_Set_Pending 0x00000100
#define NVIC_Interrupt_Set_Pending_Register1_41_RTCAlarm_Set_Pending 0x00000200
#define NVIC_Interrupt_Set_Pending_Register1_42_OTG_FS_WKUP_Set_Pending 0x00000400

//Interrupt Clear-Pending Register
//Interrupt Clear-Pending Register0
#define NVIC_Interrupt_Clear_Pending_Register0_0_WWDG_Clear_Pending 0x00000001
#define NVIC_Interrupt_Clear_Pending_Register0_1_PVD_Clear_Pending 0x00000002
#define NVIC_Interrupt_Clear_Pending_Register0_2_TAMPER_Clear_Pending 0x00000004
#define NVIC_Interrupt_Clear_Pending_Register0_3_RTC_Clear_Pending 0x00000008
#define NVIC_Interrupt_Clear_Pending_Register0_4_FLASH_Clear_Pending 0x00000010
#define NVIC_Interrupt_Clear_Pending_Register0_5_RCC_Clear_Pending 0x00000020
#define NVIC_Interrupt_Clear_Pending_Register0_EXTI0_Clear_Pending 0x00000040
#define NVIC_Interrupt_Clear_Pending_Register0_7_EXTI1_Clear_Pending 0x00000080
#define NVIC_Interrupt_Clear_Pending_Register0_8_EXTI2_Clear_Pending 0x00000100
#define NVIC_Interrupt_Clear_Pending_Register0_9_EXTI3_Clear_Pending 0x00000200
#define NVIC_Interrupt_Clear_Pending_Register0_10_EXTI4_Clear_Pending 0x00000400
#define NVIC_Interrupt_Clear_Pending_Register0_11_DMA1_CH1_Clear_Pending 0x00000800
#define NVIC_Interrupt_Clear_Pending_Register0_12_DMA1_CH2_Clear_Pending 0x00001000
#define NVIC_Interrupt_Clear_Pending_Register0_13_DMA1_CH3_Clear_Pending 0x00002000
#define NVIC_Interrupt_Clear_Pending_Register0_14_DMA1_CH4_Clear_Pending 0x00004000
#define NVIC_Interrupt_Clear_Pending_Register0_15_DMA1_CH5_Clear_Pending 0x00008000
#define NVIC_Interrupt_Clear_Pending_Register0_16_DMA1_CH6_Clear_Pending 0x00010000
#define NVIC_Interrupt_Clear_Pending_Register0_17_DMA1_CH7_Clear_Pending 0x00020000
#define NVIC_Interrupt_Clear_Pending_Register0_18_ADC1_2_Clear_Pending 0x00040000
#define NVIC_Interrupt_Clear_Pending_Register0_19_CAN1_TX_Clear_Pending 0x00080000
#define NVIC_Interrupt_Clear_Pending_Register0_20_CAN1_RX0_Clear_Pending 0x00100000
#define NVIC_Interrupt_Clear_Pending_Register0_21_CAN1_RX1_Clear_Pending 0x00200000
#define NVIC_Interrupt_Clear_Pending_Register0_22_CAN_SCE_Clear_Pending 0x00400000
#define NVIC_Interrupt_Clear_Pending_Register0_23_EXTI9_5_Clear_Pending 0x00800000
#define NVIC_Interrupt_Clear_Pending_Register0_24_TIM1_BRK_Clear_Pending 0x01000000
#define NVIC_Interrupt_Clear_Pending_Register0_25_TIM1_UP_Clear_Pending 0x02000000
#define NVIC_Interrupt_Clear_Pending_Register0_26_TIM1_TRG_COM_Clear_Pending 0x04000000
#define NVIC_Interrupt_Clear_Pending_Register0_27_TIM1_CC_Clear_Pending 0x08000000
#define NVIC_Interrupt_Clear_Pending_Register0_28_TIM2_Clear_Pending 0x10000000
#define NVIC_Interrupt_Clear_Pending_Register0_29_TIM3_Clear_Pending 0x20000000
#define NVIC_Interrupt_Clear_Pending_Register0_30_TIM4_Clear_Pending 0x40000000
#define NVIC_Interrupt_Clear_Pending_Register0_31_I2C1_EV_Clear_Pending 0x80000000
//Interrupt Clear-Pending Register1
#define NVIC_Interrupt_Clear_Pending_Register1_32_I2C1_ER_Clear_Pending 0x00000001
#define NVIC_Interrupt_Clear_Pending_Register1_33_I2C2_EV_Clear_Pending 0x00000002
#define NVIC_Interrupt_Clear_Pending_Register1_34_I2C2_ER_Clear_Pending 0x00000004
#define NVIC_Interrupt_Clear_Pending_Register1_35_SPI1_Clear_Pending 0x00000008
#define NVIC_Interrupt_Clear_Pending_Register1_36_SPI2_Clear_Pending 0x00000010
#define NVIC_Interrupt_Clear_Pending_Register1_37_USART1_Clear_Pending 0x00000020
#define NVIC_Interrupt_Clear_Pending_Register1_38_USART2_Clear_Pending 0x00000040
#define NVIC_Interrupt_Clear_Pending_Register1_39_USART3_Clear_Pending 0x00000080
#define NVIC_Interrupt_Clear_Pending_Register1_40_EXTI15_10_Clear_Pending 0x00000100
#define NVIC_Interrupt_Clear_Pending_Register1_41_RTCAlarm_Clear_Pending 0x00000200
#define NVIC_Interrupt_Clear_Pending_Register1_42_OTG_FS_WKUP_Clear_Pending 0x00000400

//Interrupt Active Bit Register
//Interrupt Active Bit Register0
#define NVIC_Interrupt_Active_Bit_Register0_0_WWDG_Active 0x00000001
#define NVIC_Interrupt_Active_Bit_Register0_1_PVD_Active 0x00000002
#define NVIC_Interrupt_Active_Bit_Register0_2_TAMPER_Active 0x00000004
#define NVIC_Interrupt_Active_Bit_Register0_3_RTC_Active 0x00000008
#define NVIC_Interrupt_Active_Bit_Register0_4_FLASH_Active 0x00000010
#define NVIC_Interrupt_Active_Bit_Register0_5_RCC_Active 0x00000020
#define NVIC_Interrupt_Active_Bit_Register0_EXTI0_Active 0x00000040
#define NVIC_Interrupt_Active_Bit_Register0_7_EXTI1_Active 0x00000080
#define NVIC_Interrupt_Active_Bit_Register0_8_EXTI2_Active 0x00000100
#define NVIC_Interrupt_Active_Bit_Register0_9_EXTI3_Active 0x00000200
#define NVIC_Interrupt_Active_Bit_Register0_10_EXTI4_Active0x00000400
#define NVIC_Interrupt_Active_Bit_Register0_11_DMA1_CH1_Active 0x00000800
#define NVIC_Interrupt_Active_Bit_Register0_12_DMA1_CH2_Active 0x00001000
#define NVIC_Interrupt_Active_Bit_Register0_13_DMA1_CH3_Active 0x00002000
#define NVIC_Interrupt_Active_Bit_Register0_14_DMA1_CH4_Active 0x00004000
#define NVIC_Interrupt_Active_Bit_Register0_15_DMA1_CH5_Active 0x00008000
#define NVIC_Interrupt_Active_Bit_Register0_16_DMA1_CH6_Active 0x00010000
#define NVIC_Interrupt_Active_Bit_Register0_17_DMA1_CH7_Active 0x00020000
#define NVIC_Interrupt_Active_Bit_Register0_18_ADC1_2_Active 0x00040000
#define NVIC_Interrupt_Active_Bit_Register0_19_CAN1_TX_Active 0x00080000
#define NVIC_Interrupt_Active_Bit_Register0_20_CAN1_RX0_Active 0x00100000
#define NVIC_Interrupt_Active_Bit_Register0_21_CAN1_RX1_Active 0x00200000
#define NVIC_Interrupt_Active_Bit_Register0_22_CAN_SCE_Active 0x00400000
#define NVIC_Interrupt_Active_Bit_Register0_23_EXTI9_5_Active 0x00800000
#define NVIC_Interrupt_Active_Bit_Register0_24_TIM1_BRK_Active 0x01000000
#define NVIC_Interrupt_Active_Bit_Register0_25_TIM1_UP_Active 0x02000000
#define NVIC_Interrupt_Active_Bit_Register0_26_TIM1_TRG_COM_Active 0x04000000
#define NVIC_Interrupt_Active_Bit_Register0_27_TIM1_CC_Active 0x08000000
#define NVIC_Interrupt_Active_Bit_Register0_28_TIM2_Active 0x10000000
#define NVIC_Interrupt_Active_Bit_Register0_29_TIM3_Active 0x20000000
#define NVIC_Interrupt_Active_Bit_Register0_30_TIM4_Active 0x40000000
#define NVIC_Interrupt_Active_Bit_Register0_31_I2C1_EV_Active 0x80000000
//Interrupt Active Bit Register1
#define NVIC_Interrupt_Active_Bit_Register1_32_I2C1_ER_Active 0x00000001
#define NVIC_Interrupt_Active_Bit_Register1_33_I2C2_EV_Active 0x00000002
#define NVIC_Interrupt_Active_Bit_Register1_34_I2C2_ER_Active 0x00000004
#define NVIC_Interrupt_Active_Bit_Register1_35_SPI1_Active 0x00000008
#define NVIC_Interrupt_Active_Bit_Register1_36_SPI2_Active 0x00000010
#define NVIC_Interrupt_Active_Bit_Register1_37_USART1_Active 0x00000020
#define NVIC_Interrupt_Active_Bit_Register1_38_USART2_Active 0x00000040
#define NVIC_Interrupt_Active_Bit_Register1_39_USART3_Active 0x00000080
#define NVIC_Interrupt_Active_Bit_Register1_40_EXTI15_10_Active 0x00000100
#define NVIC_Interrupt_Active_Bit_Register1_41_RTCAlarm_Active 0x00000200
#define NVIC_Interrupt_Active_Bit_Register1_42_OTG_FS_WKUP_Active 0x00000400

//Interrupt Priority Register
#define STM32F103C8_Interrupt_CHx_MaX_Num 42
#define STM32F103C8_Config_num_MaX_Num 15
static inline void Interrupt_Priority_Config(unsigned char Interrupt_CHx,unsigned char Config_num)
{
	if((Interrupt_CHx>STM32F103C8_Interrupt_CHx_MaX_Num)||(Config_num>STM32F103C8_Config_num_MaX_Num))
	{
		return;
	}
	unsigned char base = Interrupt_CHx/4;
	unsigned char offset = Interrupt_CHx%4;
	NVIC->IPR[base] = NVIC->IPR[base]&~(0x0000000F<<(offset*8+4));
	NVIC->IPR[base] = NVIC->IPR[base]|(Config_num<<(offset*8+4));
}

//Application Interrupt and Reset Control Register
//bit16 bit17 bit18 bit19 bit20 bit21 bit22 bit23 bit24 bit25 bit26 bit27 bit28 bit29 bit30 bit31
//写密钥 必须写入0x05FA，否则写操作被忽略
//注意：SCB->AIRCR = (0x05FA << 16) | new_value;
#define NVIC_AIRCR_VECTCLRACTIVE 0x05FA0002
#define NVIC_AIRCR_SYSRESETREQ 0x05FA0004
//中断抢占优先级与子优先级设置
#define NVIC_AIRCR_Preemption_Priority_4_Subpriority_0 0x05FA0000
#define NVIC_AIRCR_Preemption_Priority_3_Subpriority_1 0x05FA0100
#define NVIC_AIRCR_Preemption_Priority_2_Subpriority_2 0x05FA0200
#define NVIC_AIRCR_Preemption_Priority_1_Subpriority_3 0x05FA0300
#define NVIC_AIRCR_Preemption_Priority_0_Subpriority_4 0x05FA0400

#endif